[{"name":"Irving Tan","title":"★ Committee Chair\nDirector since 2025","bio":"Irving Tan\n\n★ Committee Chair\nDirector since 2025","image":"https://www.westerndigital.com/content/dam/store/en-us/assets/company/irving-tan-western-digital.png.thumb.1280.1280.png"},{"name":"Kris Sennesael","title":"","bio":"Kris Sennesael currently serves as the Chief Financial Officer of Western Digital. He is responsible for the global finance organization, including accounting, financial planning and analysis, tax, treasury, internal audit, investor relations, and corporate real estate.","image":"https://www.westerndigital.com/content/dam/store/en-us/assets/company/kris-sennesael-western-digital.png.thumb.1280.1280.png"},{"name":"Ahmed Shihab","title":"","bio":"Ahmed Shihab is the Chief Product Officer at Western Digital. In this role, he is responsible for leading engineering and product strategy as well as innovation and the development of current and future Western Digital products and solutions.","image":"https://www.westerndigital.com/content/dam/store/en-us/assets/company/ahmed-shihab-western-digital.png.thumb.1280.1280.png"},{"name":"Scott Davis","title":"","bio":"Scott Davis as a veteran sales executive with over 37 years at the company, Scott has unmatched experience in fostering deep, lasting customer relationships and cultivating high-performing teams. He has held various executive leadership roles within the company, including leading Latin America, Americas, Strategic Accounts, and most recently, serving as Senior Vice President of Global Channel and ROEM Sales.","image":"https://www.westerndigital.com/content/dam/store/en-us/assets/company/scott-davis-western-digital.png.thumb.1280.1280.png"},{"name":"Cynthia Tregillis","title":"","bio":"Cynthia Tregillis is the Chief Legal Officer and Secretary at Western Digital. She oversees the company's worldwide legal, risk management, compliance, and government relations functions.","image":"https://www.westerndigital.com/content/dam/store/en-us/assets/company/cynthia-tregillis-western-digital.png.thumb.1280.1280.png"},{"name":"Vidya Gubbi","title":"","bio":"Vidya Gubbi is the Chief of Global Operations at Western Digital. He is responsible for all global operations functions, including manufacturing operations, procurement, supply chain, quality and sustainability.","image":"https://www.westerndigital.com/content/dam/store/en-us/assets/company/vidya-gubbi-western-digital.png.thumb.1280.1280.png"},{"name":"Katie Watson","title":"","bio":"Katie Watson is the Chief Human Resources Officer at Western Digital. She oversees the company’s global human resources functions.","image":"https://www.westerndigital.com/content/dam/store/en-us/assets/company/katie-watson-western-digital.png.thumb.1280.1280.png"},{"name":"Sesh Tirumala","title":"","bio":"Sesh Tirumala is the Chief Information Officer at Western Digital, driving the company's digital transformation and fostering a culture of innovation through technology. In this role, he oversees all of Information technology, Cybersecurity, and Enterprise data and analytics.","image":"https://www.westerndigital.com/content/dam/store/en-us/assets/company/sesh-tirumala-western-digital.png.thumb.1280.1280.png"},{"name":"Jeremy Faulk","title":"","bio":"Jeremy Faulk is the Vice President of Strategy and Corporate Development at Western Digital. In this role, he is responsible for long-range planning, business and segment strategy, innovation investments, and navigating the tectonic shifts created by AI, cloud hyperscaler demand, and new storage technologies. He also partners closely with the CEO and Executive Leadership Team to align Western Digital’s technology roadmap, business priorities, and customer strategies with the company’s long-term growth objectives.","image":"https://www.westerndigital.com/content/dam/store/en-us/assets/company/jeremy-faulk-western-digital.png.thumb.1280.1280.png"},{"name":"Ginita Taylor","title":"","bio":"Ginita Taylor is the Chief of Staff to the CEO at Western Digital. She is responsible for planning and executing all aspects of the CEO office, as well as leading Strategic and Employee Communications.","image":"https://www.westerndigital.com/content/dam/store/en-us/assets/company/ginita-taylor-western-digital.png.thumb.1280.1280.png"}]